{
    "summary": "This code establishes rules and formats for microgrid devices, connections, and merging lines. It associates parameters with topology IDs and anchors, representing distinct points using one-to-one mapping. Three methods are used to represent connection relationships based on varying length topology ID groups.",
    "details": [
        {
            "comment": "Code explains the organization and rules for microgrid device types, connection types, and merging lines. It details file formats, naming conventions, connection rules, type generation rules, and data representation guidelines.",
            "location": "\"/media/root/Prima/works/generated_docs/linear_programming_doc/src/microgrid_base/type_system.md\":0-52",
            "content": "# 文件内容格式\n|  文件名  |  内容  | 格式 |\n| -- | -- | -- |\n| microgrid_v2_all_types_structured.json | 类型分类表（不包含设备名称） |  分类->能源->类型  |\n| microgrid_v2_connectivity_matrix.json |  连接类型映射表  | \"端点1_端点2\"->生成连接类型  |\n| microgrid_v2_device_port_type_mapping.json |  设备锚点类型表  |  设备分类->设备名称->锚点名称->锚点类型  |\n# 类型命名规则\n类型分为设备类型、设备锚点类型、母线类型、连接线类型、合并线类型。\n设备类型和设备名称一致。\n对于母线类型、连接线类型、合并线类型，有以下规则：\n## 前缀\n1. \"可合并\"开头的是合并线类型。\n2. \"可连接\"开头的是母线类型。\n3. \"不可连接\"开头的是连接线类型。\n除以上三种前缀以外，是设备锚点类型。\n## 后缀\n连接线类型中，\"输入\"/\"输出\"/\"输入输出\"结尾的是设备锚点和母线之间的连线类型，其余为设备锚点之间的连线类型。\n# 连接规则\n1. 设备（包括母线）不能和自己相连（同一个设备的锚点之间不能相连）。\n2. 设备每个锚点最多出来一根线。\n3. 两个母线之间最多有一根合并线。\n4. 两个设备锚点相连，判断是否可以连接，如果可以，产生对应类型的连接线。\n# 类型生成规则\n1. 母线以及用合并线与之相连的所有母线在没有设备锚点与之相连时，这些母线和合并线的类型分别为\"可连接母线\"和\"可合并母线\"(默认空类型)。\n2. 母线以及用合并线与之相连的所有母线若是默认类型，和设备锚点相连时，根据规则自动转换类型。\n3. 母线以及用合并线与之相连的所有母线若是默认类型，用合并线和其他非默认类型的母线相连时，类型自动变化。\n4. 母线最多有99个与之相连的线。\n----\n1. 合并线两端如果都是默认类型母线，则合并线是默认类型。\n2. 合并线两端如果只有一端是默认类型母线，合并线类型和默认类型母线的类型自动转换。\n3. 合并线两端如果都不是默认类型母线，检查两类型是否一致，如果一致则建立连接，否则连接失败。\n# 数据表示规则\n向算法发送数据时，需要全局信息（气象信息、设备信息、负荷信息、计算设置）、拓扑信息和连接关系。\n拓扑信息包括拓扑设备参数、ID-类型对。"
        },
        {
            "comment": "The code associates topology device parameters, device topology ID, and anchor point ID. It maps ID-type pairs as a one-to-one relationship, representing different IDs for distinct points such as devices, device anchors, conductors, or junction lines. Three methods represent connection relationships based on varying length topology ID groups: 1) Device ID -> Anchor Point ID -> Connector ID -> Anchor Point ID -> Device ID; 2) Device ID -> Anchor Point ID -> Connector ID -> Bus Bar ID; and 3) Bus Bar ID -> Merging Line ID -> Bus Bar ID.",
            "location": "\"/media/root/Prima/works/generated_docs/linear_programming_doc/src/microgrid_base/type_system.md\":54-62",
            "content": "拓扑设备参数和设备拓扑ID以及设备锚点ID相关联。\nID-类型对是一对一的映射，表示不同的ID代表点的不同类型，其中点可以是设备、设备锚点、母线、连接线、合并线。\n连接关系有三种表示方法，分别对应三种不同长度的拓扑ID组：\n1. 设备ID->设备锚点ID—>连接线ID->设备锚点ID->设备ID\n1. 设备ID->设备锚点ID—>连接线ID->母线ID\n1. 母线ID—>合并线ID->母线ID"
        }
    ]
}